
# Задание 12.7.3
#
# Вам дан словарь per_cent с распределением процентных ставок по вкладам в различных банках таким образом,
# что ключ — название банка, значение — процент.
# Напишите программу, в результате которой будет сформирован список deposit значений —
# накопленные средства за год вклада в каждом из банков.
# На вход программы с клавиатуры вводится сумма money, которую человек планирует положить под проценты.
# Добавьте в программу поиск максимального значения и его вывод на экран в формате:
# Максимальная сумма, которую вы можете заработать — deposit[i]
# Где вместо deposit[i] будет выведено максимальное значение списка.

# Ответ:
per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
money = int(input("Введите сумму вклада:"))
ТКБ = per_cent['ТКБ']
print(ТКБ)
СКБ = per_cent['СКБ']
print(СКБ)
ВТБ = per_cent['ВТБ']
print(ВТБ)
СБЕР = per_cent['СБЕР']
print(СБЕР)
deposit = []
deposit.append(round(ТКБ * money / 100))
deposit.append(round(СКБ * money / 100))
deposit.append(round(ВТБ * money / 100))
deposit.append(round(СБЕР * money / 100))
max_deposit = max(deposit)
print(deposit)
print("Максимальная сумма, которую вы можете заработать — " + str(max_deposit))